package boBingGame;

public class Judge {
	public int [] b =new int[7];
	public int gold=0;
	
	public int check(int []n)
	{
		for(int i=0;i<6;i++)
		{
			if(n[i]==1) b[1]++;
			if(n[i]==2) b[2]++;
			if(n[i]==3) b[3]++;
			if(n[i]==4) b[4]++;
			if(n[i]==5) b[5]++;
			if(n[i]==6) b[6]++;
		}
		if(b[4]==6)//红六勃（六个4）>  1
		{
			gold=1;
		}
		if(b[1]==6||b[2]==6||b[3]==6||b[5]==6||b[6]==6)//黑六勃（六个1或2或3或5或6）  2
		{
			gold=2;
		}
		if(b[4]==4&&b[1]==2)//状元插金花（四个4、二个1）   3
		{
			gold=3;
		}
		if(b[4]==5)//五红（五个4） 4
		{
			gold=4;
		}
		if(b[1]==5||b[2]==5||b[3]==5||b[5]==5||b[6]==5)//五子（五个1或2或3或5或6）  5
		{
			gold=5;
		}
		if(b[4]==4&&b[1]!=2)//四红（四个4）  6
		{
			gold=6;
		}
		if(b[1]==1&&b[2]==1&&b[3]==1&&b[4]==1&&b[5]==1&&b[6]==1)//对堂又叫榜眼    
		{
			gold=7;
		}
		if(b[4]==3)//三红又叫探花
		{
			gold=8;
		}
		if((b[1]==4||b[2]==4||b[3]==4||b[5]==4||b[6]==4)&&b[4]==2)//四进又叫进士多得一个二举。 
		{
			gold=9;
		}
		if((b[1]==4||b[2]==4||b[3]==4||b[5]==4||b[6]==4)&&b[4]==1)//四进又叫进士多得一个一秀 
		{
			gold=10;
		}
		if((b[1]==4||b[2]==4||b[3]==4||b[5]==4||b[6]==4)&&b[4]==0)//四进又叫进士
		{
			gold=11;
		}
		if(b[4]==2&&b[1]!=4&&b[2]!=4&&b[3]!=4&&b[5]!=4&&b[6]!=4)// 二举又叫举人
		{
			gold=12;
		}
		if(b[4]==1&&b[1]!=5&&b[2]!=5&&b[3]!=5&&b[5]!=5&&b[6]!=5&&b[1]!=4&&b[2]!=4&&b[3]!=4&&b[5]!=4&&b[6]!=4&&(!(b[1]==1&&b[2]==1&&b[3]==1&&b[4]==1&&b[5]==1&&b[6]==1)))//一秀又叫秀才
		{
			gold=13;
		}
		return gold;
	}

}
